 

const text = `Путник, ты двигаешься в верном направлении.

Сейчас настало время вспомнить то, как мы готовимся к нашим клубам.

Ты как никто знаешь сколько сил и времени уходит на то, чтобы сделать максимально интересный и классный клуб, и в том числе много сил тратится на подготовку особого места...

Приглядись внимательно к коллажу на заднем фоне, именно там будет ждать тебя следующая частичка пазла.`;

const speed = 35; // скорость печати (меньше — быстрее)
let index = 0;

function typeText() {
    if (index < text.length) {
        document.getElementById("typedText").innerHTML +=
            text[index] === "\n" ? "<br>" : text[index];
        index++;
        setTimeout(typeText, speed);
    }
}

window.onload = typeText;

// Проверка кода
function checkCode() {
    const correctCode = "32166"; // ← твой код
    const input = document.getElementById("codeInput").value;

    if (input === correctCode) {
        window.location.href = "music.html";
    } else {
        alert("Код неверный. Приглядись внимательнее 👀");
    }
}